InformationRegisters/СтатусыДокументовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыДокументовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДальнейшиеДействияПоВзаимодействиюИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияПоВзаимодействиюИСМП</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/гф_ЭмиссияКодовМаркировкиВызовСервера/Ext/Module.bsl
Функция гф_СоздатьЗаказНаЭмиссиюКодовМаркировки(Основание) Экспорт
	
	СтруктураВозврата = Новый Структура("ОписаниеОшибки,"
	+ "ЗаказНаЭмиссиюКодовМаркировкиСУЗ,"
	+ "Организация,"
	+ "ЕстьОшибкиЗаполнения,"
	+ "Статус,"
	+ "ДальнейшееДействие,"
	+ "ЗаказКодовВозможен");

	Если Не ЗначениеЗаполнено(Основание) Тогда
		СтруктураВозврата["ОписаниеОшибки"] = "Не заполнено основание для создания ""Заказа на эмиссию кодов маркировки""";
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ДокументОснование = Основание;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка КАК Ссылка,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			СтруктураВозврата["ОписаниеОшибки"] = "Уже существует документ "
			+ Выборка["Ссылка"] + " с основанием " + Выборка["ДокументОснование"] + "
			|Документ ""Заказ на эмиссию кодов маркировки"" не создан.";
			Возврат СтруктураВозврата;
		КонецЕсли;
		
		ЗаказНаМаркировку = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Организация");
		ЗаказНаМаркировку.Организация = Организация;
		ЗаказНаМаркировку.Дата = ТекущаяДатаСеанса();
		ЗаказНаМаркировку.Заполнить(ДокументОснование);
		Для каждого ТекущаяСтрока Из ЗаказНаМаркировку.Товары Цикл
			массивGNIN = ИнтеграцияИСМП.МассивЗначенийGTINДляВыбора(ТекущаяСтрока, ЗаказНаМаркировку, Ложь);
			Если ТипЗнч(массивGNIN) = Тип("Массив") И массивGNIN.ВГраница() > -1 Тогда
				ТекущаяСтрока["GTIN"] = массивGNIN[0];
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОшибкиЗаполнения = ЗаказНаМаркировку.ПроверитьЗаполнение();
		Если ЕстьОшибкиЗаполнения Тогда
			
			СтруктураВозврата["ЕстьОшибкиЗаполнения"] = Истина;
			
		КонецЕсли;
		ЗаказНаМаркировку.Записать(РежимЗаписиДокумента.Проведение);
		СтруктураВозврата["ЗаказНаЭмиссиюКодовМаркировкиСУЗ"] = ЗаказНаМаркировку.Ссылка;
		СтруктураВозврата["Организация"] = Организация;
		МенеджерОбъекта = ИнтеграцияИС.МенеджерОбъектаПоСсылке(ЗаказНаМаркировку.Ссылка);
		Статус = МенеджерОбъекта.СтатусПоУмолчанию();
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбъектРасчета", ЗаказНаМаркировку);
		ДопустимыеДействия = МенеджерОбъекта.ДопустимыеДействия(ЗаказНаМаркировку);
		Если ЗначениеЗаполнено(ЗаказНаМаркировку.Ссылка) Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Статусы.Статус КАК Статус,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие1
			|	КОНЕЦ КАК ДальнейшееДействие1,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие2
			|	КОНЕЦ КАК ДальнейшееДействие2,
			|	ВЫБОР
			|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.НеТребуется)
			|		ИНАЧЕ Статусы.ДальнейшееДействие3
			|	КОНЕЦ КАК ДальнейшееДействие3
			|ИЗ
			|	РегистрСведений.СтатусыДокументовИСМП КАК Статусы
			|ГДЕ
			|	Статусы.Документ = &Документ");
			
			Запрос.УстановитьПараметр("Документ", ЗаказНаМаркировку.Ссылка);
			Запрос.УстановитьПараметр(
			"МассивДальнейшиеДействия", ИнтеграцияИСМП.НеотображаемыеВДокументахДальнейшиеДействия());
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				Статус = Выборка.Статус;
				
				ДальнейшееДействие = Новый Массив;
				
				ДальнейшиеДействияРегистр = Новый Массив;
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие1);
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие2);
				ДальнейшиеДействияРегистр.Добавить(Выборка.ДальнейшееДействие3);
				
				Для Каждого ДальнейшееДействиеРегиср Из ДальнейшиеДействияРегистр Цикл
					
					ДобавляемоеДействие = ДальнейшееДействиеРегиср;
					Если ДопустимыеДействия.Найти(ДобавляемоеДействие) = Неопределено Тогда
						Если ДобавляемоеДействие =
							Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеGTINНаОстатки Тогда
							ДобавляемоеДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки;
						ИначеЕсли ДобавляемоеДействие =
							Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки Тогда
							ДобавляемоеДействие = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеGTINНаОстатки;
						КонецЕсли;
					КонецЕсли;
					
					Если ДальнейшееДействие.Найти(ДобавляемоеДействие) = Неопределено Тогда
						ДальнейшееДействие.Добавить(ДобавляемоеДействие);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			ДальнейшееДействие = МенеджерОбъекта.ДальнейшееДействиеПоУмолчанию(СтруктураПараметров);
		КонецЕсли;
		
		
		СтруктураВозврата["Статус"] = Статус;
		Если ДальнейшееДействие.ВГраница() > -1  Тогда
			СтруктураВозврата["ДальнейшееДействие"] = ДальнейшееДействие[0];
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП.Черновик И 
			(ДальнейшееДействие.ВГраница() > -1 
			И ДальнейшееДействие[0] = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки)
			И (ДопустимыеДействия.ВГраница() > -1 
			И ДопустимыеДействия.Найти(Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеКодыМаркировки) <> Неопределено)  Тогда
			
			СтруктураВозврата["ЗаказКодовВозможен"] = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
